espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/mt793x_sdk/filogic/middleware/third_party/tfm/trusted-firmware-m/platform/ext/target/cypress/psoc64/Device/Source/iar/startup_psoc64_ns.s
; Reset Handler
                SECTION  .text:CODE:REORDER:NOROOT(2)
                EXTERN   Cy_SystemInitFpuEnable
                PUBWEAK  Reset_Handler

Reset_Handler
                LDR     R0, =Cy_SystemInitFpuEnable
                BLX     R0
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0


                PUBWEAK Cy_SysLib_FaultHandler
Cy_SysLib_FaultHandler
                B       .

                PUBWEAK  HardFault_Handler
HardFault_Handler
                movs    r0, #4
                mov     r1, LR
                tst     r0, r1
                beq     L_MSP
                mrs     r0, PSP
                b       L_API_call
L_MSP
                mrs     r0, MSP
L_API_call
                ; Storing LR content for Creator call stack trace
                push    {LR}
                bl      Cy_SysLib_FaultHandler

; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK  NMI_Handler
NMI_Handler
                B       .

                PUBWEAK  MemManage_Handler
MemManage_Handler
                B       .

                PUBWEAK  BusFault_Handler
BusFault_Handler
                B       .

                PUBWEAK  UsageFault_Handler
UsageFault_Handler
                B       .

                PUBWEAK  SVC_Handler
SVC_Handler
                B       .

                PUBWEAK  DebugMon_Handler
DebugMon_Handler
                B       .

                PUBWEAK  PendSV_Handler
PendSV_Handler
                B       .

                PUBWEAK  SysTick_Handler
SysTick_Handler
                B       .


                    PUBWEAK  Default_Handler
Default_Handler
                    PUBWEAK  ioss_interrupts_gpio_0_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_1_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_2_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_3_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_4_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_5_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_6_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_7_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_8_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_9_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_10_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_11_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_12_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_13_IRQHandler
                    PUBWEAK  ioss_interrupts_gpio_14_IRQHandler
                    PUBWEAK  ioss_interrupt_gpio_IRQHandler
                    PUBWEAK  ioss_interrupt_vdd_IRQHandler
                    PUBWEAK  lpcomp_interrupt_IRQHandler
                    PUBWEAK  scb_8_interrupt_IRQHandler
                    PUBWEAK  srss_interrupt_mcwdt_0_IRQHandler
                    PUBWEAK  srss_interrupt_mcwdt_1_IRQHandler
                    PUBWEAK  srss_interrupt_backup_IRQHandler
                    PUBWEAK  srss_interrupt_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_1_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_2_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_3_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_5_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_6_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_7_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_8_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_9_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_10_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_11_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_12_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_13_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_14_IRQHandler
                    PUBWEAK  cpuss_interrupts_ipc_15_IRQHandler
                    PUBWEAK  scb_0_interrupt_IRQHandler
                    PUBWEAK  scb_1_interrupt_IRQHandler
                    PUBWEAK  scb_2_interrupt_IRQHandler
                    PUBWEAK  scb_3_interrupt_IRQHandler
                    PUBWEAK  scb_4_interrupt_IRQHandler
                    PUBWEAK  scb_5_interrupt_IRQHandler
                    PUBWEAK  scb_6_interrupt_IRQHandler
                    PUBWEAK  scb_7_interrupt_IRQHandler
                    PUBWEAK  scb_9_interrupt_IRQHandler
                    PUBWEAK  scb_10_interrupt_IRQHandler
                    PUBWEAK  scb_11_interrupt_IRQHandler
                    PUBWEAK  scb_12_interrupt_IRQHandler
                    PUBWEAK  csd_interrupt_IRQHandler
                    PUBWEAK  cpuss_interrupts_dmac_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_dmac_1_IRQHandler
                    PUBWEAK  cpuss_interrupts_dmac_2_IRQHandler
                    PUBWEAK  cpuss_interrupts_dmac_3_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_1_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_2_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_3_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_4_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_5_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_6_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_7_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_8_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_9_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_10_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_11_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_12_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_13_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_14_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_15_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_16_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_17_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_18_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_19_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_20_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_21_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_22_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_23_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_24_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_25_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_26_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_27_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw0_28_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_1_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_2_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_3_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_4_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_5_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_6_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_7_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_8_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_9_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_10_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_11_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_12_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_13_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_14_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_15_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_16_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_17_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_18_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_19_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_20_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_21_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_22_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_23_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_24_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_25_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_26_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_27_IRQHandler
                    PUBWEAK  cpuss_interrupts_dw1_28_IRQHandler
                    PUBWEAK  cpuss_interrupts_fault_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_fault_1_IRQHandler
                    PUBWEAK  cpuss_interrupt_crypto_IRQHandler
                    PUBWEAK  cpuss_interrupts_cm4_fp_IRQHandler
                    PUBWEAK  cpuss_interrupts_cm0_cti_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_cm0_cti_1_IRQHandler
                    PUBWEAK  cpuss_interrupts_cm4_cti_0_IRQHandler
                    PUBWEAK  cpuss_interrupts_cm4_cti_1_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_0_IRQHandler
                    PUBWEAK  TIMER1_Handler
                    PUBWEAK  tcpwm_0_interrupts_2_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_3_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_4_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_5_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_6_IRQHandler
                    PUBWEAK  tcpwm_0_interrupts_7_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_0_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_1_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_2_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_3_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_4_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_5_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_6_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_7_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_8_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_9_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_10_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_11_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_12_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_13_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_14_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_15_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_16_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_17_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_18_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_19_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_20_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_21_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_22_IRQHandler
                    PUBWEAK  tcpwm_1_interrupts_23_IRQHandler
                    PUBWEAK  pass_interrupt_sar_IRQHandler
                    PUBWEAK  audioss_0_interrupt_i2s_IRQHandler
                    PUBWEAK  audioss_0_interrupt_pdm_IRQHandler
                    PUBWEAK  audioss_1_interrupt_i2s_IRQHandler
                    PUBWEAK  profile_interrupt_IRQHandler
                    PUBWEAK  smif_interrupt_IRQHandler
                    PUBWEAK  usb_interrupt_hi_IRQHandler
                    PUBWEAK  usb_interrupt_med_IRQHandler
                    PUBWEAK  usb_interrupt_lo_IRQHandler
                    PUBWEAK  sdhc_0_interrupt_wakeup_IRQHandler
                    PUBWEAK  sdhc_0_interrupt_general_IRQHandler
                    PUBWEAK  sdhc_1_interrupt_wakeup_IRQHandler
                    PUBWEAK  sdhc_1_interrupt_general_IRQHandler

